In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('DataScience_salaries_2025.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 93597 entries, 0 to 93596
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           93597 non-null  int64
 1   experience_level    93597 non-null  object
 2   employment_type     93597 non-null  object
 3   job_title           93597 non-null  object
 4   salary              93597 non-null  int64
 5   salary_currency     93597 non-null  object
 6   salary_in_usd       93597 non-null  int64
 7   employee_residence  93597 non-null  object
 8   remote_ratio        93597 non-null  int64
 9   company_location    93597 non-null  object
 10  company_size        93597 non-null  object
dtypes: int64(4), object(7)
memory usage: 7.9+ MB

In [4]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025,MI,FT,Research Scientist,208000,USD,208000,US,0,US,M
1,2025,MI,FT,Research Scientist,147000,USD,147000,US,0,US,M
2,2025,SE,FT,Research Scientist,173000,USD,173000,US,0,US,M
3,2025,SE,FT,Research Scientist,117000,USD,117000,US,0,US,M
4,2025,MI,FT,AI Engineer,100000,USD,100000,US,100,US,M

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 93597 entries, 0 to 93596
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           93597 non-null  int64
 1   experience_level    93597 non-null  object
 2   employment_type     93597 non-null  object
 3   job_title           93597 non-null  object
 4   salary              93597 non-null  int64
 5   salary_currency     93597 non-null  object
 6   salary_in_usd       93597 non-null  int64
 7   employee_residence  93597 non-null  object
 8   remote_ratio        93597 non-null  int64
 9   company_location    93597 non-null  object
 10  company_size        93597 non-null  object
dtypes: int64(4), object(7)
memory usage: 7.9+ MB

In [6]:
df['work_year'].unique()

array([2025, 2024, 2022, 2023, 2020, 2021])

In [7]:
df12020 = df[df['work_year'] == 2020]

In [8]:
df12020.info()

<class 'pandas.core.frame.DataFrame'>
Index: 75 entries, 86261 to 93595
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           75 non-null     int64
 1   experience_level    75 non-null     object
 2   employment_type     75 non-null     object
 3   job_title           75 non-null     object
 4   salary              75 non-null     int64
 5   salary_currency     75 non-null     object
 6   salary_in_usd       75 non-null     int64
 7   employee_residence  75 non-null     object
 8   remote_ratio        75 non-null     int64
 9   company_location    75 non-null     object
 10  company_size        75 non-null     object
dtypes: int64(4), object(7)
memory usage: 7.0+ KB

In [9]:
df12020.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
86261,2020,EN,FT,Azure Data Engineer,100000,USD,100000,MU,0,MU,S
86464,2020,EN,CT,Staff Data Analyst,60000,CAD,44753,CA,50,CA,L
88297,2020,SE,FT,Staff Data Scientist,164000,USD,164000,US,50,US,M
88774,2020,EN,FT,Data Analyst,42000,EUR,47899,DE,0,DE,L
88806,2020,EX,FT,Data Scientist,300000,USD,300000,US,100,US,L

In [10]:
df12020.duplicated().sum()

np.int64(0)